In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv(r'E:\python_beginner\models personal\house price prediction\Bengaluru_House_Data.csv')

In [3]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [5]:
df.shape

(13320, 9)

In [6]:
for col in df.columns:
    print(df[col].value_counts())
    print('***********')

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64
***********
availability
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
16-Oct               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: count, Length: 81, dtype: int64
***********
location
Whitefield                         540
Sarjapur  Road                     399
Electronic City                    302
Kanakpura Road                     273
Thanisandra                        234
                                  ...
3rd Stage Raja Rajeshwari Nagar      1
Chuchangatta Colony                  1
Electronic City Phase 1,             1
Chikbasavanapura                     1
Abshot Layout                        1
Name: count, Length: 1305, dtype: int64
***********
size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
27 BHK           1
19 BHK           1
43 Bedroom       1
16 BHK           1
14 BHK           1
12 Bedroom       1
13 BHK           1
18 Bedroom       1
Name: count, dtype: int64
***********
society
GrrvaGr    80
PrarePa    76
Prtates    59
Sryalan    59
GMown E    56
           ..
SNadeAr     1
DSellil     1
Shensit     1
VKvenas     1
Vemes H     1
Name: count, Length: 2688, dtype: int64
***********
total_sqft
1200           843
1100           221
1500           205
2400           196
600            180
              ...
2920             1
5665.84          1
1369             1
7150             1
1200 - 1470      1
Name: count, Length: 2117, dtype: int64
***********
bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
11.0       3
13.0       3
16.0       2
27.0       1
14.0       1
40.0       1
15.0       1
18.0       1
Name: count, dtype: int64
***********
balcony
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: count, dtype: int64
***********
price
75.00    310
65.00    302
55.00    275
60.00    270
45.00    240
        ...
43.04      1
61.11      1
46.56      1
42.54      1
47.35      1
Name: count, Length: 1994, dtype: int64
***********

In [7]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [8]:
df.drop(columns=['area_type','availability','society'],inplace=True)

In [9]:
df.fillna({'balcony': 0},inplace=True)

In [10]:
df.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
balcony        0
price          0
dtype: int64

In [11]:
df.sample(5)

                 location   size total_sqft  bath  balcony  price
1345          Hennur Road  3 BHK       2060   3.0      1.0  149.0
597         RMV Extension  3 BHK       1630   3.0      2.0   85.0
2347       Nandini Layout  2 BHK       1200   2.0      2.0   70.0
8562  Kundalahalli Colony  3 BHK       1477   2.0      2.0   75.0
2509                Hoodi  2 BHK       1400   2.0      1.0   78.0

In [12]:
df.describe()

               bath       balcony         price
count  13247.000000  13320.000000  13320.000000
mean       2.692610      1.511937    112.565627
std        1.341458      0.864240    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   balcony     13320 non-null  float64
 5   price       13320 non-null  float64
dtypes: float64(3), object(3)
memory usage: 624.5+ KB

In [14]:
df['location'].value_counts()

location
Whitefield                         540
Sarjapur  Road                     399
Electronic City                    302
Kanakpura Road                     273
Thanisandra                        234
                                  ...
3rd Stage Raja Rajeshwari Nagar      1
Chuchangatta Colony                  1
Electronic City Phase 1,             1
Chikbasavanapura                     1
Abshot Layout                        1
Name: count, Length: 1305, dtype: int64

In [15]:
df['location'] = df['location'].fillna('Sarjapur Road')

In [16]:
df['size'].value_counts()

size
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
27 BHK           1
19 BHK           1
43 Bedroom       1
16 BHK           1
14 BHK           1
12 Bedroom       1
13 BHK           1
18 Bedroom       1
Name: count, dtype: int64

In [17]:
df['size'] = df['size'].fillna('2 BHK')

In [18]:
df['bath'].value_counts()

bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
11.0       3
13.0       3
16.0       2
27.0       1
14.0       1
40.0       1
15.0       1
18.0       1
Name: count, dtype: int64

In [19]:
df['bath'] = df['bath'].fillna(df['bath'].median())

In [20]:
df.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [21]:
df['bhk'] = df['size'].str.split().str.get(0).astype(int)

In [22]:
df[df['bhk']>20]

,location,size,total_sqft,bath,balcony,price,bhk
1718,2Electronic City Phase II,27 BHK,8000,27.0,0.0,230.0,27
4684,Munnekollal,43 Bedroom,2400,40.0,0.0,660.0,43

In [23]:
df['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [24]:
def convertToRange(x):
    temp = x.split('-')
    if len(temp)==2:
        return (float(temp[0])+float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [25]:
df['total_sqft'] = df['total_sqft'].apply(convertToRange)

In [26]:
df['total_sqft'].unique()

array([1056. , 2600. , 1440. , ..., 1258.5,  774. , 4689. ])

In [27]:
df['price_per_sqft'] = df['price']*100000 / df['total_sqft']

In [28]:
df.sample(5)

,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
2045,Horamavu Banaswadi,2 BHK,1307.0,2.0,2.0,51.6,2,3947.972456
11642,Belatur,2 BHK,1275.0,2.0,2.0,59.0,2,4627.450980
4584,Uttarahalli,3 BHK,1360.0,2.0,3.0,61.2,3,4500.000000
11790,"Hoodi Circle,",1 BHK,793.0,1.0,1.0,40.0,1,5044.136192
13167,Benson Town,2 Bedroom,1688.0,2.0,0.0,280.0,2,16587.677725

In [29]:
df.describe()

,total_sqft,bath,balcony,price,bhk,price_per_sqft
count,13274.000000,13320.000000,13320.000000,13320.000000,13320.000000,1.327400e+04
mean,1559.626694,2.688814,1.511937,112.565627,2.802778,7.907501e+03
std,1238.405258,1.338754,0.864240,148.971674,1.294496,1.064296e+05
min,1.000000,1.000000,0.000000,8.000000,1.000000,2.678298e+02
25%,1100.000000,2.000000,1.000000,50.000000,2.000000,4.266865e+03
50%,1276.000000,2.000000,2.000000,72.000000,3.000000,5.434306e+03
75%,1680.000000,3.000000,2.000000,120.000000,3.000000,7.311746e+03
max,52272.000000,40.000000,3.000000,3600.000000,43.000000,1.200000e+07

In [30]:
df['location'].value_counts()

location
Whitefield                                      540
Sarjapur  Road                                  399
Electronic City                                 302
Kanakpura Road                                  273
Thanisandra                                     234
                                               ...
Maragondana Halli, kr puram, old madras road      1
Chikkajala                                        1
Udayagiri                                         1
pavitra paradise                                  1
Chikbasavanapura                                  1
Name: count, Length: 1306, dtype: int64

In [31]:
df['location'] = df['location'].apply(lambda x: x.strip())
location_count = df['location'].value_counts()

In [32]:
location_count

location
Whitefield                541
Sarjapur  Road            399
Electronic City           304
Kanakpura Road            273
Thanisandra               237
                         ...
Xavier Layout               1
Ramanagara Channapatna      1
Maheswari Nagar             1
Hsr layout sector3          1
Thyagraj Nagar              1
Name: count, Length: 1295, dtype: int64

In [33]:
location_count_less_10 = location_count[location_count<=10]

In [34]:
location_count_less_10

location
1st Block Koramangala     10
Dairy Circle              10
Nagadevanahalli           10
Sadashiva Nagar           10
Naganathapura             10
                          ..
Xavier Layout              1
Ramanagara Channapatna     1
Maheswari Nagar            1
Hsr layout sector3         1
Thyagraj Nagar             1
Name: count, Length: 1054, dtype: int64

In [35]:
df['location'] = df['location'].apply(lambda x: 'others' if x in location_count_less_10 else x)

In [36]:
df['location'].value_counts()

location
others                       2886
Whitefield                    541
Sarjapur  Road                399
Electronic City               304
Kanakpura Road                273
                             ...
Tindlu                         11
Marsur                         11
2nd Phase Judicial Layout      11
Thyagaraja Nagar               11
HAL 2nd Stage                  11
Name: count, Length: 242, dtype: int64

In [37]:
df.describe()

,total_sqft,bath,balcony,price,bhk,price_per_sqft
count,13274.000000,13320.000000,13320.000000,13320.000000,13320.000000,1.327400e+04
mean,1559.626694,2.688814,1.511937,112.565627,2.802778,7.907501e+03
std,1238.405258,1.338754,0.864240,148.971674,1.294496,1.064296e+05
min,1.000000,1.000000,0.000000,8.000000,1.000000,2.678298e+02
25%,1100.000000,2.000000,1.000000,50.000000,2.000000,4.266865e+03
50%,1276.000000,2.000000,2.000000,72.000000,3.000000,5.434306e+03
75%,1680.000000,3.000000,2.000000,120.000000,3.000000,7.311746e+03
max,52272.000000,40.000000,3.000000,3600.000000,43.000000,1.200000e+07

In [38]:
(df['total_sqft']/df['bhk']).describe()

count    13274.000000
mean       575.074878
std        388.205175
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [39]:
df = df[((df['total_sqft']/df['bhk'])>=300)]

In [40]:
df.describe()

,total_sqft,bath,balcony,price,bhk,price_per_sqft
count,12530.000000,12530.000000,12530.000000,12530.000000,12530.000000,12530.000000
mean,1594.564544,2.559537,1.522267,111.382401,2.650838,6303.979357
std,1261.271296,1.077938,0.852536,152.077329,0.976678,4162.237981
min,300.000000,1.000000,0.000000,8.440000,1.000000,267.829813
25%,1116.000000,2.000000,1.000000,49.000000,2.000000,4210.526316
50%,1300.000000,2.000000,2.000000,70.000000,3.000000,5294.117647
75%,1700.000000,3.000000,2.000000,115.000000,3.000000,6916.666667
max,52272.000000,16.000000,3.000000,3600.000000,16.000000,176470.588235

In [41]:
df.shape

(12530, 8)

In [42]:
df.price_per_sqft.describe()

count     12530.000000
mean       6303.979357
std        4162.237981
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [43]:
def remove_outliers_sqft(df):
    df_output = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m = np.mean(subdf.price_per_sqft)

        st = np.std(subdf.price_per_sqft)


        gen_df = subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft<=(m+st))]
        df_output = pd.concat([df_output,gen_df],ignore_index = True)
    return df_output

In [44]:
df = remove_outliers_sqft(df)
df.describe()

,total_sqft,bath,balcony,price,bhk,price_per_sqft
count,10301.000000,10301.000000,10301.000000,10301.000000,10301.000000,10301.000000
mean,1508.440608,2.471702,1.536064,91.286372,2.574896,5659.062876
std,880.694214,0.979449,0.836535,86.342786,0.897649,2265.774749
min,300.000000,1.000000,0.000000,10.000000,1.000000,1250.000000
25%,1110.000000,2.000000,1.000000,49.000000,2.000000,4244.897959
50%,1286.000000,2.000000,2.000000,67.000000,2.000000,5175.600739
75%,1650.000000,3.000000,2.000000,100.000000,3.000000,6428.571429
max,30400.000000,16.000000,3.000000,2200.000000,16.000000,24509.803922

In [45]:
df.value_counts()
# df.head()

location             size       total_sqft  bath  balcony  price   bhk  price_per_sqft
Haralur Road         2 BHK      1243.0      2.0   2.0      46.00   2    3700.724055       16
TC Palaya            3 Bedroom  1200.0      2.0   0.0      66.00   3    5500.000000       12
others               3 BHK      1464.0      3.0   2.0      56.00   3    3825.136612       11
Chandapura           1 BHK      645.0       1.0   1.0      16.45   1    2550.387597       11
HSR Layout           2 BHK      1140.0      2.0   2.0      46.00   2    4035.087719        9
                                                                                          ..
others               7 BHK      4100.0      7.0   0.0      140.00  7    3414.634146        1
                     7 Bedroom  2500.0      6.0   2.0      115.00  7    4600.000000        1
                                2800.0      7.0   1.0      250.00  7    8928.571429        1
                                                  2.0      125.00  7    4464.285714        1
1st Block Jayanagar  2 BHK      1235.0      2.0   2.0      148.00  2    11983.805668       1
Name: count, Length: 9555, dtype: int64

In [46]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats ={}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk] ={
                'mean': np.mean(bhk_df.price_per_sqft),             
                'std': np.std(bhk_df.price_per_sqft),
                 'count': bhk_df.shape[0]
            }
        for bhk,bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices,bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [47]:
df = bhk_outlier_remover(df)

In [48]:
df.shape

(7361, 8)

In [49]:
df

,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
0,1st Block Jayanagar,4 BHK,2850.0,4.0,1.0,428.0,4,15017.543860
1,1st Block Jayanagar,3 BHK,1630.0,3.0,2.0,194.0,3,11901.840491
2,1st Block Jayanagar,3 BHK,1875.0,2.0,3.0,235.0,3,12533.333333
3,1st Block Jayanagar,3 BHK,1200.0,2.0,0.0,130.0,3,10833.333333
4,1st Block Jayanagar,2 BHK,1235.0,2.0,2.0,148.0,2,11983.805668
...,...,...,...,...,...,...,...,...
10292,others,2 BHK,1200.0,2.0,3.0,70.0,2,5833.333333
10293,others,1 BHK,1800.0,1.0,1.0,200.0,1,11111.111111
10296,others,2 BHK,1353.0,2.0,2.0,110.0,2,8130.081301
10297,others,1 Bedroom,812.0,1.0,0.0,26.0,1,3201.970443
10300,others,4 BHK,3600.0,5.0,0.0,400.0,4,11111.111111

In [50]:
df.drop(columns=['size','price_per_sqft'],inplace=True) # we only used price_per_sqft for cleaning

In [51]:
df.head()

              location  total_sqft  bath  balcony  price  bhk
0  1st Block Jayanagar      2850.0   4.0      1.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0      2.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0      3.0  235.0    3
3  1st Block Jayanagar      1200.0   2.0      0.0  130.0    3
4  1st Block Jayanagar      1235.0   2.0      2.0  148.0    2

In [52]:
df.to_csv('Cleaned_data.csv')

In [53]:
df.head()

              location  total_sqft  bath  balcony  price  bhk
0  1st Block Jayanagar      2850.0   4.0      1.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0      2.0  194.0    3
2  1st Block Jayanagar      1875.0   2.0      3.0  235.0    3
3  1st Block Jayanagar      1200.0   2.0      0.0  130.0    3
4  1st Block Jayanagar      1235.0   2.0      2.0  148.0    2

In [54]:
# columns = ['location']
# for col in columns:
#     print(df[col].value_counts())
#     print("*"*20)

In [55]:
df = pd.read_csv('Cleaned_data_2.csv')

In [56]:
def new_col_buyable(df):
    rows = []

    # Ensure price is numeric and clean
    df['price'] = pd.to_numeric(df['price'], errors='coerce')

    # Group by location and bhk
    for (location, bhk), group in df.groupby(['location', 'bhk']):
        if group.empty:
            continue

        mean_price = group['price'].mean()
        price_threshold = mean_price * 1.1  # Allow up to 15% above average

        for _, row in group.iterrows():
            buyable = 1 if row['price'] <= price_threshold else 0
            rows.append({**row, 'buyable': buyable})

    return pd.DataFrame(rows)

In [59]:
df.head()

,Unnamed: 0,location,total_sqft,bath,balcony,price,bhk,buyable
0,0,1st Block Jayanagar,1235.0,2,2,148.0,2,1
1,1,1st Block Jayanagar,1630.0,3,2,194.0,3,1
2,2,1st Block Jayanagar,1875.0,2,3,235.0,3,0
3,3,1st Block Jayanagar,1200.0,2,0,130.0,3,1
4,4,1st Block Jayanagar,2850.0,4,1,428.0,4,1

In [ ]:
# Let's analyze the issues with our buyable classification
print("=== BUYABLE DISTRIBUTION ANALYSIS ===")
print(f"Total records: {len(df)}")
print(f"Buyable distribution:\n{df['buyable'].value_counts()}")
print(f"Buyable percentages:\n{df['buyable'].value_counts(normalize=True)*100}")

print("\n=== PRICE ANALYSIS ===")
print(f"Price statistics:\n{df['price'].describe()}")

print("\n=== ISSUES IDENTIFIED ===")
print("1. DATA LEAKAGE: Using 'price' to predict 'buyable' but including 'price' in features")
print("2. THRESHOLD LOGIC: Current threshold might be too strict or lenient")
print("3. Let's check some examples:")

# Check some examples
sample_location = '1st Block Jayanagar'
sample_data = df[df['location'] == sample_location].head(10)
print(f"\nSample data for {sample_location}:")
print(sample_data[['bhk', 'price', 'buyable']].sort_values('price'))

## Fixed Buyable Classification Model

**Problems identified:**
1. **Data Leakage**: Using `price` as a feature to predict `buyable` when `buyable` was created from `price`
2. **Inconsistent Threshold**: Code says 1.1 (10%) but comment says 15%
3. **Feature Engineering**: Need better features that don't include the target-derived information

**Solution:**
1. Remove `price` from features (fix data leakage)
2. Use features like `location`, `bhk`, `total_sqft`, `bath`, `balcony` to predict if a house is buyable
3. Create a more reasonable threshold for "buyable" classification

In [ ]:
def improved_buyable_classification(df, threshold_percentile=75):
    """
    Improved buyable classification based on price percentiles within location-bhk groups
    
    Args:
        df: DataFrame with house data
        threshold_percentile: Percentile threshold for buyable classification (default: 75)
                            Houses below this percentile are considered 'buyable'
    """
    df_copy = df.copy()
    df_copy['buyable'] = 0
    
    # Group by location and bhk to create more reasonable comparisons
    for (location, bhk), group in df_copy.groupby(['location', 'bhk']):
        if len(group) < 3:  # Skip groups with too few samples
            continue
            
        # Calculate the threshold price (e.g., 75th percentile)
        price_threshold = group['price'].quantile(threshold_percentile / 100)
        
        # Mark houses as buyable if they're below the threshold
        mask = (df_copy['location'] == location) & (df_copy['bhk'] == bhk)
        df_copy.loc[mask, 'buyable'] = (df_copy.loc[mask, 'price'] <= price_threshold).astype(int)
    
    return df_copy

# Create improved buyable classification
df_improved = improved_buyable_classification(df, threshold_percentile=70)

print("=== IMPROVED BUYABLE DISTRIBUTION ===")
print(f"Buyable distribution:\n{df_improved['buyable'].value_counts()}")
print(f"Buyable percentages:\n{df_improved['buyable'].value_counts(normalize=True)*100}")

# Check the same sample
sample_location = '1st Block Jayanagar'
sample_data = df_improved[df_improved['location'] == sample_location].head(10)
print(f"\nImproved classification for {sample_location}:")
print(sample_data[['bhk', 'price', 'buyable']].sort_values('price'))

In [ ]:
# ===== CORRECTED MACHINE LEARNING MODEL =====

# STEP 1: Prepare features WITHOUT price (to avoid data leakage)
# The model should predict buyable based on property characteristics, not price
X_corrected = df_improved[['location', 'total_sqft', 'bath', 'balcony', 'bhk']]
y_corrected = df_improved['buyable']

print("=== CORRECTED FEATURE SET ===")
print("Features (X):", X_corrected.columns.tolist())
print("Target (y): buyable")
print(f"X shape: {X_corrected.shape}")
print(f"y distribution:\n{y_corrected.value_counts()}")

# Import required libraries
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import Pipeline
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix

# STEP 2: Split the data
X_train, X_test, y_train, y_test = train_test_split(
    X_corrected, y_corrected, test_size=0.2, random_state=42, stratify=y_corrected
)

print(f"\nTrain set: {X_train.shape}, Test set: {X_test.shape}")
print(f"Train target distribution:\n{y_train.value_counts(normalize=True)}")
print(f"Test target distribution:\n{y_test.value_counts(normalize=True)}")

In [ ]:
# STEP 3: Create preprocessing pipeline
column_transformer = make_column_transformer(
    (OneHotEncoder(sparse_output=False, handle_unknown='ignore'), ['location']),
    remainder='passthrough'
)

# STEP 4: Build multiple models for comparison

# Model 1: Logistic Regression
lr_pipeline = Pipeline([
    ('preprocessor', column_transformer),
    ('scaler', StandardScaler()),
    ('classifier', LogisticRegression(class_weight='balanced', random_state=42, max_iter=1000))
])

# Model 2: Random Forest (often better for this type of problem)
rf_pipeline = Pipeline([
    ('preprocessor', column_transformer),
    ('classifier', RandomForestClassifier(n_estimators=100, class_weight='balanced', random_state=42))
])

# STEP 5: Train both models
print("=== TRAINING MODELS ===")

# Train Logistic Regression
print("Training Logistic Regression...")
lr_pipeline.fit(X_train, y_train)
lr_pred = lr_pipeline.predict(X_test)
lr_accuracy = accuracy_score(y_test, lr_pred)

# Train Random Forest
print("Training Random Forest...")
rf_pipeline.fit(X_train, y_train)
rf_pred = rf_pipeline.predict(X_test)
rf_accuracy = accuracy_score(y_test, rf_pred)

print(f"\nLogistic Regression Accuracy: {lr_accuracy:.4f}")
print(f"Random Forest Accuracy: {rf_accuracy:.4f}")

# Choose the better model
if rf_accuracy > lr_accuracy:
    best_model = rf_pipeline
    best_pred = rf_pred
    model_name = "Random Forest"
else:
    best_model = lr_pipeline
    best_pred = lr_pred
    model_name = "Logistic Regression"

print(f"\nBest Model: {model_name} (Accuracy: {max(lr_accuracy, rf_accuracy):.4f})")

In [ ]:
# STEP 6: Detailed evaluation of the best model
print("=== DETAILED MODEL EVALUATION ===")
print(f"Model: {model_name}")
print(f"Accuracy: {max(lr_accuracy, rf_accuracy):.4f}")
print(f"\nClassification Report:")
print(classification_report(y_test, best_pred))
print(f"\nConfusion Matrix:")
print(confusion_matrix(y_test, best_pred))

# STEP 7: Feature importance (for Random Forest)
if model_name == "Random Forest":
    # Get feature names after preprocessing
    feature_names = (best_model.named_steps['preprocessor']
                    .named_transformers_['onehotencoder']
                    .get_feature_names_out(['location']).tolist() + 
                    ['total_sqft', 'bath', 'balcony', 'bhk'])
    
    importances = best_model.named_steps['classifier'].feature_importances_
    
    print(f"\n=== TOP 10 MOST IMPORTANT FEATURES ===")
    feature_importance = list(zip(feature_names, importances))
    feature_importance.sort(key=lambda x: x[1], reverse=True)
    
    for i, (feature, importance) in enumerate(feature_importance[:10]):
        print(f"{i+1}. {feature}: {importance:.4f}")

# STEP 8: Create a prediction function
def predict_buyable(location, total_sqft, bath, balcony, bhk):
    """
    Predict if a house is buyable based on its characteristics
    """
    input_data = pd.DataFrame([{
        'location': location,
        'total_sqft': total_sqft,
        'bath': bath,
        'balcony': balcony,
        'bhk': bhk
    }])
    
    prediction = best_model.predict(input_data)[0]
    probability = best_model.predict_proba(input_data)[0]
    
    result = "BUYABLE" if prediction == 1 else "NOT BUYABLE"
    confidence = max(probability) * 100
    
    return result, confidence

print(f"\n=== PREDICTION FUNCTION CREATED ===")
print("Use predict_buyable(location, total_sqft, bath, balcony, bhk) to make predictions")

In [ ]:
df.to_csv('Cleaned_data_2.csv')

In [ ]:
X = df.drop(columns=['buyable'])
y = df['buyable']

In [ ]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge,LogisticRegression
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import Pipeline
from sklearn.metrics import r2_score

In [ ]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2,random_state=2)

In [ ]:
print(X_train.shape)
print(X_test.shape)

In [ ]:
df.sample(5)

In [ ]:
column_trans = make_column_transformer((OneHotEncoder(sparse_output=False),['location']),remainder ='passthrough')

In [ ]:
scaler = StandardScaler()

In [ ]:
lor = LogisticRegression(class_weight='balanced')

In [ ]:
pipe = Pipeline([
    ('columns_trans',column_trans),
    ('standard_scaler',scaler),
    ('logistic regression',lor)
])

In [ ]:
pipe.fit(X_train,y_train)

In [ ]:
y_pred_r = pipe.predict(X_test)

In [ ]:
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix

y_pred = pipe.predict(X_test)

print("Accuracy:", accuracy_score(y_test, y_pred))
print(classification_report(y_test, y_pred))
print("Confusion Matrix:\n", confusion_matrix(y_test, y_pred))

In [ ]:
custom_input = pd.DataFrame([{
    'location': '1st Block Jayanagar',
    'total_sqft': 2400.0,
    'bath': 1,
    'balcony': 3,
    'bhk': 4,
    'price': 32212010  # Your value
}])

In [ ]:
prediction = pipe.predict(custom_input)

In [ ]:
prediction

In [ ]:
input_df = pd.DataFrame([{
    'location': '1st Block Jayanagar',
    'total_sqft': 1240.0,
    'bath': 2,
    'balcony': 3,
    'bhk': 2,
    'price': 2212010
}])

prediction = pipe.predict(input_df)
print("Prediction:", prediction)

In [ ]:
import pickle

In [ ]:
pickle.dump(pipe,open('logisticRegressionModel.pkl','wb'))

In [ ]:
import sklearn

In [ ]:
import sklearn
print(sklearn.__version__)